src/test/resources/bodies/apiTest/crear_cuentas_siebel/crearCuentas.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="urn://bancodebogota.com/accounts/product/service/"
                  xmlns:even="urn://bancodebogota.com/accounts/product/event/"
                  xmlns:v1="urn://bancodebogota.com/ifx/base/v1/"
                  xmlns:v11="urn://bancodebogota.com/accounts/product/v1/"
                  xmlns:v12="urn://bancodebogota.com/ifx/lite/v1/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:setClientAccountOpeningRequest>
            <even:ClientAccountOpeningAddRq>
                <v1:RqUID>a18eafa0-ce60-11e0-9572-000010867937</v1:RqUID>
                <v1:CustId>
                    <v1:SPName>${tipced}</v1:SPName>
                    <v1:CustPermId>${numero}</v1:CustPermId>
                </v1:CustId>
                <v1:NextDay>0</v1:NextDay>
                <v1:ClientTerminalSeqId>123456</v1:ClientTerminalSeqId>
                <v1:NetworkTrnInfo>
                    <v1:NetworkOwner>DIG482</v1:NetworkOwner>
                    <v1:TerminalId>IN01</v1:TerminalId>
                    <v1:TerminalType>12345</v1:TerminalType>
                    <v1:Desc>0086600230</v1:Desc>
                    <v1:Name>0121</v1:Name>
                </v1:NetworkTrnInfo>
                <v1:ClientDt>2025-03-31T10:00:00</v1:ClientDt>
                <v11:CustomerInfo>
                    <CIIU>14</CIIU>
                    <v1:PersonName>
                        <v1:LastName>TOBON</v1:LastName>
                        <v1:LastName>ARIAS</v1:LastName>
                        <v1:FirstName>JHON</v1:FirstName>
                        <v1:MiddleName>ALEJANDRO</v1:MiddleName>
                    </v1:PersonName>
                    <Gender>M</Gender>
                    <BirthDt>1996-05-11</BirthDt>
                    <v11:ContactInfo>
                        <v11:PhoneNum>
                            <v1:Phone>3003980520</v1:Phone>
                        </v11:PhoneNum>
                        <EmailAddr>aalfar2@bancodebogota.com.co</EmailAddr>
                    </v11:ContactInfo>
                    <v1:BranchId>1526</v1:BranchId>
                    <v1:BranchName>Portal 80</v1:BranchName>
                    <PayRollCode>003</PayRollCode>
                </v11:CustomerInfo>
                <v12:AcctBasicInfo>
                    <v1:AcctType>SDA</v1:AcctType>
                    <v1:AcctSubType>010AH</v1:AcctSubType>
                    <v12:BankInfo>
                        <v1:BankId>1234</v1:BankId>
                        <v1:BranchId>0062</v1:BranchId>
                    </v12:BankInfo>
                </v12:AcctBasicInfo>
                <v12:RefInfo>
                    <v1:RefType>plantilla_notificacion</v1:RefType>
                    <v1:RefId>not_plantilla01</v1:RefId>
                </v12:RefInfo>
                <v12:RefInfo>
                    <v1:RefType>cuota_administracion</v1:RefType>
                    <v1:RefId>3</v1:RefId>
                </v12:RefInfo>
                <v1:BankInfo>
                    <v1:BranchId>1234</v1:BranchId>
                </v1:BankInfo>
                <v1:OverdraftDays>30</v1:OverdraftDays>
            </even:ClientAccountOpeningAddRq>
        </ser:setClientAccountOpeningRequest>
    </soapenv:Body>
</soapenv:Envelope>